mxyxbb/LVGL_STM32F411_HAL_HandheldWeatherStation/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "mymath.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define LCD_DC_Pin GPIO_PIN_4
#define LCD_DC_GPIO_Port GPIOA
#define LCD_RST_Pin GPIO_PIN_6
#define LCD_RST_GPIO_Port GPIOA
#define LCD_CS_Pin GPIO_PIN_0
#define LCD_CS_GPIO_Port GPIOB
#define BT7L_MOD_Pin GPIO_PIN_1
#define BT7L_MOD_GPIO_Port GPIOB
#define BT7L_LP_Pin GPIO_PIN_2
#define BT7L_LP_GPIO_Port GPIOB
#define INT_TP1_Pin GPIO_PIN_10
#define INT_TP1_GPIO_Port GPIOB
#define BUZZER1_EN_Pin GPIO_PIN_12
#define BUZZER1_EN_GPIO_Port GPIOB
#define LCD_BL_Pin GPIO_PIN_13
#define LCD_BL_GPIO_Port GPIOB
#define INT1_Pin GPIO_PIN_4
#define INT1_GPIO_Port GPIOB
#define INT2_Pin GPIO_PIN_5
#define INT2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
#define BuzzerClr() HAL_GPIO_WritePin(BUZZER1_EN_GPIO_Port,BUZZER1_EN_Pin,0)
#define BTClr() HAL_GPIO_WritePin(BT7L_LP_GPIO_Port,BT7L_LP_Pin,GPIO_PIN_RESET)
#define BTSet() HAL_GPIO_WritePin(BT7L_LP_GPIO_Port,BT7L_LP_Pin,GPIO_PIN_SET)
#define LEDClr() HAL_GPIO_WritePin(LED_GPIO_Port,LED_Pin,GPIO_PIN_SET)


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
